emacs.d/thomasf-emacs.org
#+TITLE: Thomas Frössmans gnu emacs configuration
#+AUTHOR: Thomas Frössman
#+EMAIL: thomasf@jossystem.se
#+TAGS: issue(i)
#+TODO: TODO DONE
#+LANGUAGE: en
#+PROPERTY: exports code
#+PROPERTY: no-expand
#+OPTIONS: toc:2 num:nil ^:nil
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t TeX:t LaTeX:nil skip:nil d:t tags:not-in-toc
#+INFOJS_OPT: view:showall toc:t ltoc:t mouse:underline buttons:0 sdepth:2 path:../org-res/org-info.js
#+STYLE:    <link rel="stylesheet" type="text/css" href="../org-res/style.css" />
#+STARTUP:indent
#+STARTUP:hidestars

* Introduction
This is very very much a work in progress..
I'm both quite new to org mode and have just
recently started merging all my config files
together using org-babel in this file.

Some things has even stopped working,
I'll fix things as I miss them.

* Files and headers
** thomasf-init.el
Bootstrap
#+begin_src emacs-lisp :tangle thomasf-init.el
;;
;; DO NOT EDIT THIS FILE BY HAND!
;; This file is generated from thomasf-emacs.org
;;

(provide 'thomasf-init)
#+end_src

** thomasf-emacs.el
Main configuration file
#+begin_src emacs-lisp
;;
;; DO NOT EDIT THIS FILE BY HAND!
;; This file is generated from thomasf-emacs.org
;;
#+end_src

** thomasf-org.el
All orgmode configuration
#+begin_src emacs-lisp :tangle thomasf-org.el
;;
;; DO NOT EDIT THIS FILE BY HAND!
;; This file is generated from thomasf-emacs.org
;;

(provide 'thomasf-org)
#+end_src

** thomasf-gui.el
Stuff that only should load when a window system is available.

#+begin_src emacs-lisp :tangle thomasf-gui.el
;;
;; DO NOT EDIT THIS FILE BY HAND!
;; This file is generated from thomasf-emacs.org
;;

(provide 'thomasf-gui)
#+end_src
* Bootstrap
** Turn off unwanted UI elements at once
To avoid momentary display
#+begin_src emacs-lisp :tangle thomasf-init.el
(if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
(if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
#+end_src

** Less clutter and distractions on start up
#+begin_src emacs-lisp :tangle thomasf-init.el
(setq inhibit-startup-message t
      inhibit-splash-screen t
      inhibit-startup-buffer-menu t
      inhibit-startup-echo-area-message t
      initial-scratch-message ";; scratch buffer -- remember to be happy, maybe, etc. \n\n"
      )
#+end_src
** Emacs24 version check
#+begin_src emacs-lisp :tangle thomasf-init.el
  (when (or (not (boundp 'emacs-version))
            (string< emacs-version "24.0"))
    (error (concat "emacs config requires Emacs 24.0 or later.")))
#+end_src
** Set up load paths early Provide the org-mode environment at once
Because babel should not have any chance to load from anywhere else
#+begin_src emacs-lisp :tangle thomasf-init.el
(setq vendor-dir (concat dotfiles-dir "vendor/"))
(setq notes-dir (file-truename "~/notes/"))

(let ((default-directory vendor-dir))
  (setq load-path
        (append
         (let ((load-path (copy-sequence load-path)))
           (append
            (copy-sequence (normal-top-level-add-to-load-path '(".")))
            (normal-top-level-add-subdirs-to-load-path)))
         load-path)))
(setq org-modules '(org-bibtex org-docview org-id org-info org-jsinfo org-habit org-mew org-mhe org-vm org-wl org-w3m org-git-link org-velocity))
(require 'cl)
(require 'org-install)
#+end_src

** Load thomasf-init if it's not loaded already
If dotfiles-dir is not set, set it to the directory of
this file and add that directory to the load path.
#+begin_src emacs-lisp
  (unless (boundp 'dotfiles-dir)
    (setq dotfiles-dir (file-name-directory (or load-file-name (buffer-file-name))))
    (add-to-list 'load-path dotfiles-dir))
#+end_src

Make sure that the init file is loaded.
#+begin_src emacs-lisp
(require 'thomasf-init)
#+end_src

* Startup
** Path variables and load paths
Themes load paths
#+begin_src emacs-lisp
(setq themes-dir (concat dotfiles-dir "themes/"))
(add-to-list 'load-path (concat themes-dir "solarized-bbatsov"))
(add-to-list 'custom-theme-load-path themes-dir)
(add-to-list 'custom-theme-load-path (concat themes-dir "solarized-bbatsov"))
#+end_src
** Files that should not be version controlled should gather in their own directory
#+begin_src emacs-lisp
  (setq local-data-dir (concat dotfiles-dir "localdata/"))

  (make-directory local-data-dir t)
  (defvar backup-dir (concat  local-data-dir "backups/" (user-real-login-name) "/"))
  (defvar autosave-dir (concat local-data-dir  "autosaves/" (user-login-name) "/"))
  (make-directory autosave-dir t)

  (setq save-place-file (concat local-data-dir "saveplace")
        savehist-file (concat local-data-dir "savehist")
        ac-comphist-file (concat local-data-dir "ac-comphist.dat")
        recentf-save-file (concat local-data-dir "recentf")
        bookmark-default-file (concat local-data-dir "bookmarks")
        org-clock-persist-file (concat local-data-dir "org-clock-save.el")
        org-id-locations-file (concat local-data-dir "org-id-locations")
        tramp-persistency-file-name (concat local-data-dir "tramp")
        tramp-backup-directory-alist backup-directory-alist
        backup-directory-alist (list (cons "." backup-dir))
        auto-save-file-name-transforms `((".*" ,autosave-dir t))
        custom-file (concat local-data-dir "custom-set-variables.el")
        smex-save-file (concat local-data-dir "smex-items")
        )
#+end_src
** Load package system
#+begin_src emacs-lisp
(require 'package)
(setq package-archives
      '(("original"    . "http://tromey.com/elpa/")
        ("gnu"         . "http://elpa.gnu.org/packages/")
        ("marmalade"   . "http://marmalade-repo.org/packages/")))
(package-initialize)
#+end_src
** Try to load private settings
#+begin_src emacs-lisp
(load "~/.emacs-private" 'noerror 'nomessage)
#+end_src
** Load customize set variables
#+begin_src emacs-lisp
(load custom-file 'noerror 'nomessage)
#+end_src
** Set up autoloads
#+begin_src emacs-lisp
  (autoload 'multi-web-mode "multi-web-mode" "Multi web mode" t)
  (autoload 'sws-mode "sws-mode" "Sws mode" t)
  (autoload 'jade-mode "jade-mode" "Jade mode" t)
  (autoload 'stylus-mode "stylus-mode" "Stylus mode" t)
  (autoload 'describe-unbound-keys "unbound" "Find unbound keys" t)
  (autoload 'zencoding-mode "zencoding-mode" "Zen coding mode" t)
  (autoload 'nyan-mode "nyan-mode" "Nyan mode" t)
  (autoload 'artbollocks-mode "artbollocks-mode" "Artbollocks mode" t)

  (autoload 'haskell-align-imports "haskell-align-imports" "haskell-align-imports" t)
  (autoload 'haskell-navigate-imports "haskell-navigate-imports" "haskell-navigate-imports" t)
  (autoload 'haskell-sort-imports "haskell-sort-imports" "haskell-sort-imports" t)

  (load "haskell-site-file")
  (load "50magit")

#+end_src
** Require whats always wanted
#+begin_src emacs-lisp
(require 'thomasf-org)
(if window-system (require 'thomasf-gui))
(require 'saveplace)
(require 'ffap)
(require 'uniquify)
(require 'ansi-color)
(require 'recentf)
(require 'undo-tree)
(smex-initialize)
;;(require 'smex)
(load "sv-kalender" 'noerror 'nomessage)
;; might want to auto load these instead
(require 'table)
;(require 'anything-config)
;(require 'sclang nil 'noerror)
#+end_src

New stuff, to want?
#+begin_src emacs-lisp
  (require 'nav)
;;  (require 'find-file-in-project)
#+end_src

* Common
** Use UTF8 as much as possible
#+begin_src emacs-lisp
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
(set-language-environment "UTF-8")       ; prefer utf-8 for language settings
(set-input-method nil)                   ; no funky input for normal editing;
(setq read-quoted-char-radix 10)         ; use decimal, not octal
#+end_src

** UI related settings
#+begin_src emacs-lisp
(global-font-lock-mode t)
#+end_src
** TODO Misc settings
What is what?
#+begin_src emacs-lisp
  (setq vc-follow-symlinks t
        vc-handled-backends ()
        ring-bell-function 'ignore
        visible-bell nil
        column-number-mode t
        font-lock-maximum-decoration t

        transient-mark-mode t
        shift-select-mode nil
        delete-selection-mode nil
        set-mark-even-if-inactive t

        delete-by-moving-to-trash t
        truncate-partial-width-windows nil
        uniquify-buffer-name-style 'forward

        ;; whitespace-mode
        whitespace-line-column 100
        whitespace-style '(face
                           trailing
                           lines
                           space-before-tab
                           indentation
                           space-after-tab)

        ediff-window-setup-function 'ediff-setup-windows-plain
        x-select-enable-clipboard t
        interprogram-paste-function 'x-cut-buffer-or-selection-value

        browse-url-browser-function 'browse-url-generic
        browse-url-generic-program "sensible-browser"



        tramp-default-method "ssh"
        anything-command-map-prefix-key "C-<f5>"

        ;;glasses-separator "␣"
        lexical-illusions nil
        )

  (setq-default tab-width 3
                indent-tabs-mode nil
                indicate-empty-lines nil
                imenu-auto-rescan t
                save-place t
                )

  (ansi-color-for-comint-mode-on)
  (auto-compression-mode t)
  (recentf-mode 1)
  (savehist-mode 1)
  (show-paren-mode 1)

  (nyan-mode 1)

  (electric-pair-mode t)
  (electric-indent-mode -1)
  (electric-layout-mode t)

  (setq show-paren-style 'parenthesis)

  ;; init random seed
  (random t)

  ;; use y/n prompts instead of yes/no
  (defalias 'yes-or-no-p 'y-or-n-p)


#+end_src
** Setup themes and gui stuff
#+begin_src emacs-lisp :tangle thomasf-gui.el
(setq day-mode-theme 'solarized-light
      night-mode-theme 'solarized-dark)

(load-theme day-mode-theme)

(require 'pretty-mode)
(global-pretty-mode 1)

#+end_src

** TODO Auto-complete
Have to creae a default autocomplete conf thats better

Current:

#+begin_src emacs-lisp
  (require 'auto-complete)
  (require 'auto-complete-config)
  (global-auto-complete-mode t)
  (setq ac-auto-start nil)
  (setq ac-dwim nil) ; To get pop-ups with docs even if a word is uniquely completed

  ;; MOVE TO KEYB?
  (define-key ac-completing-map (kbd "C-n") 'ac-next)
  (define-key ac-completing-map (kbd "C-p") 'ac-previous)

  ;;----------------------------------------------------------------------------
  ;; Use Emacs' built-in TAB completion hooks to trigger AC (Emacs >= 23.2)
  ;;
  (setq tab-always-indent 'complete)  ;; use 'complete when auto-complete is disabled
  (add-to-list 'completion-styles 'initials t)

  ;; hook AC into completion-at-point
  (defun set-auto-complete-as-completion-at-point-function ()
    (setq completion-at-point-functions '(auto-complete)))
  (add-hook 'auto-complete-mode-hook 'set-auto-complete-as-completion-at-point-function)

  (set-default 'ac-sources
               '(ac-source-dictionary
                 ac-source-yasnippet
                 ac-source-words-in-buffer
                 ac-source-words-in-same-mode-buffers
                 ac-source-words-in-all-buffer))

  (dolist (mode '(magit-log-edit-mode log-edit-mode org-mode text-mode haml-mode
                                      sass-mode yaml-mode csv-mode espresso-mode haskell-mode
                                      html-mode nxml-mode sh-mode smarty-mode clojure-mode
                                      lisp-mode textile-mode markdown-mode tuareg-mode
                                      css-mode less-css-mode))
    (add-to-list 'ac-modes mode))

  ;; Exclude very large buffers from dabbrev
  (defun smp-dabbrev-friend-buffer (other-buffer)
    (< (buffer-size other-buffer) (* 1 1024 1024)))

  (setq dabbrev-friend-buffer-function 'smp-dabbrev-friend-buffer)
  (add-to-list 'ac-dictionary-directories (concat vendor-dir "auto-complete/dict/"))

  (ac-config-default)
#+end_src

Somethings to be inspired by?
#+begin_src emacs-lisp :tangle no
   (require 'auto-complete)
   (require 'auto-complete-config)
   (global-auto-complete-mode t)
   (setq ac-auto-start nil)
   (setq ac-dwim nil) ; To get pop-ups with docs even if a word is uniquely completed
   (define-key ac-completing-map (kbd "C-n") 'ac-next)
   (define-key ac-completing-map (kbd "C-p") 'ac-previous)

   ;;----------------------------------------------------------------------------
   ;; Use Emacs' built-in TAB completion hooks to trigger AC (Emacs >= 23.2)
   ;;----------------------------------------------------------------------------
   (setq tab-always-indent 'complete)  ;; use 'complete when auto-complete is disabled
   (add-to-list 'completion-styles 'initials t)

   ;; hook AC into completion-at-point
   (defun set-auto-complete-as-completion-at-point-function ()
     (setq completion-at-point-functions '(auto-complete)))
   (add-hook 'auto-complete-mode-hook 'set-auto-complete-as-completion-at-point-function)


   (set-default 'ac-sources
                '(ac-source-dictionary
                  ac-source-words-in-buffer
                  ac-source-words-in-same-mode-buffers
                  ac-source-words-in-all-buffer))

   (dolist (mode '(magit-log-edit-mode log-edit-mode org-mode text-mode haml-mode
                                       sass-mode yaml-mode csv-mode espresso-mode haskell-mode
                                       html-mode nxml-mode sh-mode smarty-mode clojure-mode
                                       lisp-mode textile-mode markdown-mode tuareg-mode
                                       css-mode less-css-mode))
  (add-to-list 'ac-modes mode))


   ;; Exclude very large buffers from dabbrev
   (defun smp-dabbrev-friend-buffer (other-buffer)
     (< (buffer-size other-buffer) (* 1 1024 1024)))

   (setq dabbrev-friend-buffer-function 'smp-dabbrev-friend-buffer)
   (add-to-list 'ac-dictionary-directories (concat vendor-dir "auto-complete/dict/"))

   (ac-config-default)


#+end_src

** Load yasnippet

#+begin_src emacs-lisp
  (require 'dropdown-list)
  (require 'yasnippet)
  (setq yas/verbosity 0
        yas/snippet-dirs (list (concat dotfiles-dir "/snippets")
                               (concat dotfiles-dir "/snippets-imported"))
        yas/prompt-functions '(yas/dropdown-prompt))

  (yas/global-mode 1)
#+end_src

** TODO Currently unused
#+begin_src emacs-lisp :tangle no
 (setq mac-option-modifier nil
       mac-command-modifier 'meta
      x-select-enable-clipboard t)

;; Trim whitespace before save)
 (add-hook 'before-save-hook 'delete-trailing-whitespace)
#+end_src

